cask_args appdir: '/Applications'

# configure taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'

# configure something..?
brew 'mas'
brew 'svn'

# utilities
brew 'vim'
brew 'curl'
brew 'nmap'
brew 'gh'
brew 'tig'
brew 'jq'
brew 'tree'
brew 'wifi-password'
brew 'tldr'
brew 'autojump'

# to configure the prompt
brew 'starship'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'
brew 'zsh-completions'

# programming languages or utilities
brew 'git'
brew 'node'
brew 'deno'
brew 'maven'
brew 'gradle'
brew 'docker'
brew 'kotlin'

# applications
cask 'visual-studio-code'
cask 'typora'
cask 'iterm2'
cask 'slack'
cask 'zoom'
cask 'spotify'
cask 'microsoft-teams'
cask 'discord'
cask 'google-chrome'

cask 'karabiner-elements'
cask 'alfred'
cask 'qlmarkdown'
cask 'quicklook-json'

# mac app store applications

mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541


# fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-nunito'
cask 'font-fira-code'

# common
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541

# private 
mas 'Spark', id: 1176895641
mas 'Things', id: 904280696
mas 'Affinity Photo', id: 824183456
mas 'Affinity Designer', id: 824171161
mas 'Grocery', id: 1195676848

# work specific
mas 'Outlook', id: 985367838
