tap "homebrew/bundle"
tap "homebrew/cask-fonts"
brew "colima"
brew "curl"
brew "docker"
brew "gh"
brew "git"
brew "mas"
brew "nmap"
brew "nvm"
brew "starship"
brew "tldr"
brew "tree"
brew "vim"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
cask "discord", args: { appdir: "/Applications" }
cask "font-fira-code", args: { appdir: "/Applications" }
cask "font-fira-code-nerd-font", args: { appdir: "/Applications" }
cask "font-source-code-pro", args: { appdir: "/Applications" }
cask "karabiner-elements", args: { appdir: "/Applications" }
cask "raycast", args: { appdir: "/Applications" }
cask "slack", args: { appdir: "/Applications" }
cask "visual-studio-code", args: { appdir: "/Applications" }
mas "Book Tracker", id: 1496543317
mas "Flow", id: 1423210932
mas "Journey", id: 1489704689
mas "Keynote", id: 409183694
mas "Mahjong Solitaire Epic", id: 687208243
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
vscode "alefragnani.project-manager"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.github-vscode-theme"
vscode "johnlindquist.kit-extension"
vscode "meganrogge.template-string-converter"
vscode "ms-azuretools.vscode-docker"
vscode "pflannery.vscode-versionlens"
vscode "redhat.fabric8-analytics"
vscode "redhat.java"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "sainoba.px-to-rem"
vscode "sleistner.vscode-fileutils"
vscode "usernamehw.errorlens"
vscode "vmware.vscode-spring-boot"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-boot-dashboard"
vscode "wayou.vscode-todo-highlight"
vscode "wix.glean"
vscode "wix.vscode-import-cost"
