tap "homebrew/bundle"
tap "homebrew/cask-fonts"
brew "colima"
brew "curl"
brew "gh"
brew "git"
brew "mas"
brew "nmap"
brew "nvm"
brew "starship"
brew "tldr"
brew "tree"
brew "vim"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
cask "docker", args: { appdir: "/Applications" }
cask "discord", args: { appdir: "/Applications" }
cask "font-fira-code", args: { appdir: "/Applications" }
cask "font-fira-code-nerd-font", args: { appdir: "/Applications" }
cask "font-source-code-pro", args: { appdir: "/Applications" }
cask "karabiner-elements", args: { appdir: "/Applications" }
cask "raycast", args: { appdir: "/Applications" }
cask "slack", args: { appdir: "/Applications" }
cask "visual-studio-code", args: { appdir: "/Applications" }
vscode "dbaeumer.vscode-eslint"
vscode "esbenp.prettier-vscode"
vscode "github.github-vscode-theme"
vscode "johnlindquist.kit-extension"
vscode "meganrogge.template-string-converter"
vscode "ms-azuretools.vscode-docker"
vscode "pflannery.vscode-versionlens"
vscode "redhat.fabric8-analytics"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "sainoba.px-to-rem"
vscode "sleistner.vscode-fileutils"
vscode "usernamehw.errorlens"
vscode "vscjava.vscode-spring-boot-dashboard"
vscode "wayou.vscode-todo-highlight"
vscode "wix.vscode-import-cost"
